Revit 2027 API
PreviewControl.ViewId Property
The view Id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; }
Public ReadOnly Property ViewId As ElementId
	Get
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
member ViewId : ElementId with get
Property Value
ElementId
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace